# FindMissingMaterials Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..FindMissingMaterials Property
NavisworksExportOptions Class See Also
---
True if the file exporter looks for a match for the materials missing from the export, false otherwise. Default value is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool FindMissingMaterials { get; set; }
```

Visual Basic
---
```text
Public Property FindMissingMaterials As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool FindMissingMaterials {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace